{
    "element": "shoji:catalog",
    "self": "/api/datasets/f32c24/variables/4f54f1/subvariables/",
    "description": "Contains the subvariables for this array variable.",
    "index": {
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000014/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000014",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Experience with specific tools (libraries, frameworks, etc.) used by the employer",
            "scale": "interval",
            "name": "Experience with specific tools (libraries, frameworks, etc.) used by the employer",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringTechExp",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000015/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000015",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Previous job titles held",
            "scale": "interval",
            "name": "Previous job titles held",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringTitles",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000009/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000009",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Educational credentials (e.g. schools attended, specific field of study, grades earned)",
            "scale": "interval",
            "name": "Educational credentials (e.g. schools attended, specific field of study, grades earned)",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringEducation",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000007/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000007",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Communication skills",
            "scale": "interval",
            "name": "Communication skills",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringCommunication",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000011/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000011",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Contributions to open source projects",
            "scale": "interval",
            "name": "Contributions to open source projects",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringOpenSource",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000012/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000012",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Experience with specific project management tools & techniques",
            "scale": "interval",
            "name": "Experience with specific project management tools & techniques",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringPMExp",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000013/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000013",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Stack Overflow reputation",
            "scale": "interval",
            "name": "Stack Overflow reputation",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringRep",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000010/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000010",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Track record of getting things done",
            "scale": "interval",
            "name": "Track record of getting things done",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringGettingThingsDone",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000008/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000008",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Previous companies worked at",
            "scale": "interval",
            "name": "Previous companies worked at",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringCompanies",
            "hidden": false,
            "type": "categorical"
        },
        "/api/datasets/f32c24/variables/4f54f1/subvariables/7dLPATPjh8h2E8vWTuZarH000006/": {
            "secure": false,
            "derived": false,
            "id": "7dLPATPjh8h2E8vWTuZarH000006",
            "description": "Congratulations! You've just been put in charge of technical recruiting at Globex, a multinational high- tech firm. This job comes with a corner office, and you have an experienced staff of recruiters at your disposal. They want to know what they should prioritize when recruiting software developers. How important should each of the following be in Globex's hiring process? Knowledge of algorithms and data structures",
            "scale": "interval",
            "name": "Knowledge of algorithms and data structures",
            "notes": "",
            "discarded": false,
            "alias": "ImportantHiringAlgorithms",
            "hidden": false,
            "type": "categorical"
        }
    }
}
